app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Second post"], ["body", "test second post"], ["created_at", "2023-11-06 22:44:12.739574"], ["updated_at", "2023-11-06 22:44:12.739574"], ["status", "private"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 4]]
---
  def destroy
    article = Article.find(params[:id])
    article.destroy