app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comments_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["commenter", "mazo"], ["body", "Comment here! "], ["article_id", 5], ["created_at", "2023-11-06 22:44:35.496405"], ["updated_at", "2023-11-06 22:44:35.496405"], ["status", "public"]]